[{
    "id":2081778,
    "type":"exposition",
    "title":"The Ecology of Artistic Research",
    "thumb":"https://media.researchcatalogue.net/rc/cache/70/aa/bb/a3/70aabba38a294253242ed2ccc290f3a8.png?t=007838df6bffc82f44653b92c23cdbd6&e=1689127200",
    "default-page":"https://www.researchcatalogue.net/view/2081778/2081726",
    "meta-data-page":"https://www.researchcatalogue.net/profile/show-exposition?exposition=2081778",
    "keywords":["Artistic research","Sustainability","Media and culture","Creative process","Performing arts","Film and media","insights","embodiment of knowledge","collaborations","Nordic region","Interdisciplinary expressions","ecology of artistic research","sustainability","artistic research","Media","knowledge systems","performing arts","Film studies","Embodied knowledge","collaboration","nordic region","interdisciplinarity","ecology of practices","ecology of creativity"],
    "abstract":"In the past decade, artistic research has emerged as a prominent means of generating new knowledge while addressing pressing issues such as sustainability and environmental concerns. However, due to its relative newness, the field lacks a clear mainstream understanding regarding its potential, meaning, structures, and limitations. The Ecology of Artistic Research is an interdisciplinary investigation that aims to explore the multifaceted dimensions of the field, with a particular focus on the significance of artistic research to researchers and practitioners themselves, and how they perceive, process, and embody knowledge through their practice. This project seeks to identify sustainable approaches to artistic research, demystify and clarify the language of artistic research for lay audiences, visualize the mechanisms of the field, and visibilize structures and networks that pay closer attention to the narratives of our world in transformation.\r\n\r\nThe investigation is conducted through a cycle of conversations and artistic responses, with a particular focus on the Nordic countries of Finland, Sweden, Norway, and Denmark. Through engaging contemporary artistic practitioners, academic institutions and researchers in conversations, the project seeks to gain insight into their work, concerns, and personal experiences. The output of this research takes various interdisciplinary forms, including audiovisual interviews, articles, and a multimedia exposition."
}, {
    "id":228399,
    "type":"exposition",
    "title":"Colonial hospitality: rethinking curatorial and artistic responsibility",
    "thumb":"https://media.researchcatalogue.net/rc/cache/94/ae/34/af/94ae34afe57265873a5a658d1104c566.png?t=07bde3c065e85636c7c1877d67249390&e=1689127200",
    "default-page":"https://www.researchcatalogue.net/view/228399/264279",
    "meta-data-page":"https://www.researchcatalogue.net/profile/show-exposition?exposition=228399",
    "keywords":["postcolonialism","hospitality","curation","responsibility","camping","Derrida","Spivak","Raqs Media Collective","Local Time"],
    "created":"18/11/2015",
    "status":"published",
    "doi":{"id":"10.22501/jar.228399","url":"https://doi.org/10.22501/jar.228399"},
    "published":"28/04/2016",
    "published_in":[{"id":2,"name":"Journal for Artistic Research","name_short":"JAR"}],
    "license":"all-rights-reserved",
    "issue":{"id":479580,"number":"10","title":null},
    "author":{"id":69230,"name":"Danny Butt"},
    "coauthors":[{"id":230420,"name":"Local Time"}],
    "abstract":"The recent enthusiasm for gestures of hospitality in contemporary art promises relief from the individualising forces of neoliberal capitalism and the professionalised hierarchies of the art world. Yet, Jacques Derrida describes the gesture of hospitality as paradoxically asserting a kind of sovereignty that underwrites the 'right to host', returning hospitality to the conditionality of the authorising institution.  In settler-colonial territories, these institutionally underwritten gestures always sit uneasily atop indigenous sovereignties that have not been ceded, requiring the positive gestures of hospitality to remain open to their structuring fissures. This paper considers figurations of hospitality and responsibility in works by Derrida, Gayatri Chakravorty Spivak, and Raqs Media Collective in reading the art collective Local Time’s research-driven practice that seeks to reconcile indigenous self-determination and settler gestures of hospitality."}]